hello = '''Простой todo: 
    1. Добавить задачу.
    2. Вывести список задач.
    3. Выход.'''

print(hello)

comand = input('Выберите команду: ')
if comand 
